Revit 2024 API
RebarConstraint.GetTargetCoverType Method
 Returns the RebarCoverType for the face specified by targetIndex. Returns null if no RebarHostData is present for target element.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public RebarCoverType GetTargetCoverType(
	int targetIndex
)
Visual Basic
Public Function GetTargetCoverType ( _
	targetIndex As Integer _
) As RebarCoverType
Visual C++
public:
RebarCoverType^ GetTargetCoverType(
	int targetIndex
)
Parameters
targetIndex
Type: System.Int32
 The index of the target. Should be between 0 and NumberOfTargets().
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  targetIndex is out of range.
Autodesk.Revit.Exceptions.InvalidOperationException |  RebarConstraint is no longer valid. -or- The RebarConstraint is not of RebarConstraintType 'FixedDistanceToHostFace' or 'ToCover.'
See Also
RebarConstraint Class
Autodesk.Revit.DB.Structure Namespace